package com.panda.sport.rcs.mgr.enums;

/**
 * @author :  myname
 * @Project Name :  xindaima
 * @Package Name :  com.panda.sport.rcs.mgr.enums
 * @Description :  TODO
 * @Date: 2020-09-06 16:28
 * @ModificationHistory Who    When    What
 * --------  ---------  --------------------------
 */
public enum RcsQuotaLimitOtherTypeEnum {
//    USER_QUOTA(1,"1000000","用户单日限额"),
    MINIMUM_LIMIT_CROSS_CUSTOMS(null,2,"10","串关最低投注额"),
    SINGLE_INJECTION_CASCADE_RATIO  (null,3,"0.5","单注串关比例"),

    ///////////////////////////////////////////////////////////////////// 足球 1////////////////////////////////////////////////////////////////////////////    //2串1
    QUOTA_PROPORTION_1_2(1,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_1_3(1,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_1_4(1,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_1_5(1,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_1_6(1,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_1_7(1,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_1_8(1,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_1_9(1,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_1_10(1,12,"5","投注项计入单关限额投注比例 10串1"),
///////////////////////////////////////////////////////////////////// 篮球 2////////////////////////////////////////////////////////////////////////////
QUOTA_PROPORTION_2_2(2,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_2_3(2,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_2_4(2,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_2_5(2,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_2_6(2,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_2_7(2,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_2_8(2,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_2_9(2,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_2_10(2,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 网球 5////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_5_2(5,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_5_3(5,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_5_4(5,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_5_5(5,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_5_6(5,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_5_7(5,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_5_8(5,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_5_9(5,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_5_10(5,12,"5","投注项计入单关限额投注比例 10串1"),
///////////////////////////////////////////////////////////////////// 乒乓球 8////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_8_2(8,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_8_3(8,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_8_4(8,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_8_5(8,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_8_6(8,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_8_7(8,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_8_8(8,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_8_9(8,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_8_10(8,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 羽毛球 10////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_10_2(10,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_10_3(10,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_10_4(10,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_10_5(10,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_10_6(10,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_10_7(10,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_10_8(10,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_10_9(10,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_10_10(10,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 斯诺克 7////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_7_2(7,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_7_3(7,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_7_4(7,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_7_5(7,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_7_6(7,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_7_7(7,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_7_8(7,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_7_9(7,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_7_10(7,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 排球 9////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_9_2(9,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_9_3(9,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_9_4(9,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_9_5(9,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_9_6(9,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_9_7(9,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_9_8(9,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_9_9(9,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_9_10(9,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 冰球 4////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_4_2(4,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_4_3(4,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_4_4(4,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_4_5(4,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_4_6(4,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_4_7(4,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_4_8(4,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_4_9(4,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_4_10(4,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 棒球 3////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_3_2(3,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_3_3(3,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_3_4(3,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_3_5(3,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_3_6(3,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_3_7(3,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_3_8(3,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_3_9(3,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_3_10(3,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 美式足球 6////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_6_2(6,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_6_3(6,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_6_4(6,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_6_5(6,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_6_6(6,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_6_7(6,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_6_8(6,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_6_9(6,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_6_10(6,12,"5","投注项计入单关限额投注比例 10串1"),
    ///////////////////////////////////////////////////////////////////// 其他////////////////////////////////////////////////////////////////////////////
    QUOTA_PROPORTION_0_2(-1,4,"0.5","投注项计入单关限额投注比例 2串1"),
    QUOTA_PROPORTION_0_3(-1,5,"0.8","投注项计入单关限额投注比例 3串1"),
    QUOTA_PROPORTION_0_4(-1,6,"1","投注项计入单关限额投注比例 4串1"),
    QUOTA_PROPORTION_0_5(-1,7,"2","投注项计入单关限额投注比例 5串1"),
    QUOTA_PROPORTION_0_6(-1,8,"2","投注项计入单关限额投注比例 6串1"),
    QUOTA_PROPORTION_0_7(-1,9,"3","投注项计入单关限额投注比例 7串1"),
    QUOTA_PROPORTION_0_8(-1,10,"3","投注项计入单关限额投注比例 8串1"),
    QUOTA_PROPORTION_0_9(-1,11,"4","投注项计入单关限额投注比例 9串1"),
    QUOTA_PROPORTION_0_10(-1,12,"5","投注项计入单关限额投注比例 10串1"),

    ///////////////////////////////////////////////////////////////////// 计入串关已用额度比例////////////////////////////////////////////////////////////////////////////
    SERIES_CONNECTION_RATIO_3(null,103,"0.5","计入串关已用额度比例3串1"),
    SERIES_CONNECTION_RATIO_4(null,104,"0.3","计入串关已用额度比例4串1"),
    SERIES_CONNECTION_RATIO_5(null,105,"0.1","计入串关已用额度比例5串1"),
    SERIES_CONNECTION_RATIO_6(null,106,"0.1","计入串关已用额度比例6串1"),
    SERIES_CONNECTION_RATIO_7(null,107,"0.1","计入串关已用额度比例7串1"),
    SERIES_CONNECTION_RATIO_8(null,108,"0.05","计入串关已用额度比例8串1"),
    SERIES_CONNECTION_RATIO_9(null,109,"0.05","计入串关已用额度比例9串1"),
    SERIES_CONNECTION_RATIO_10(null,110,"0.05","计入串关已用额度比例10串1");


    /**
     * 体育种类
     */
    private Integer sportId;
    /**
     * 类型
     */
    private Integer type;
    /**
     * 基础值 初始化的时候用
     */
    private String base;
    /**
     * 描述
     */
    private String vales;

    private RcsQuotaLimitOtherTypeEnum(Integer sportId, Integer type, String base, String vales) {
        this.sportId = sportId;
        this.type = type;
        this.base = base;
        this.vales = vales;
    }

    public Integer getType() {
        return type;
    }

    public String getVales() {
        return vales;
    }

    public String getBase() {
        return base;
    }

    public Integer getSportId() {
        return sportId;
    }
}
